jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_2,
        .tx_dma_chan = DMA1_Channel5,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART3_TX,
        .altfunc = GPIO_AF4_USART3,
    },
#endif
#ifdef USART4
    {
        .instance = USART4,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_1,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_4,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART4_RX,

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_0,
        .tx_dma_chan = DMA1_Channel6,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART4_TX,
        .altfunc = GPIO_AF4_USART4,
    },
#endif
#ifdef USART5
    {
        .instance = USART5,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOB,
        .rx_pin = GPIO_PIN_1,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_5,
        .rx_dma_request = DMA_REQUEST_USART5_RX,

        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_0,
        .tx_dma_chan = DMA1_Channel7,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART5_TX,
        .altfunc = GPIO_AF8_USART5,
    },
#endif
#ifdef USART6
    {
        .instance = USART6,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_5,
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_4,
        .tx_dma_chan = DMA2_Channel5,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART6_TX,
        .altfunc = GPIO_AF3_USART6,
    },
#endif
};

///////////// stm32g4

#elif defined(RULOS_ARM_stm32g4)

void USART1_IRQHandler() {
  dispatch_int(0);
}

void DMA1_Channel1_IRQHandler() {
  dispatch_tx_dma(0);
}

void DMA1_Channel2_IRQHandler() {
  dispatch_rx_dma(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
        .rx_dma_channel = LL_DMA_CHANNEL_2,
        .rx_dma_irqn = DMA1_Channel2_IRQn,
        .rx_dma_request = DMA_REQUEST_USART1_RX,

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel1,
        .tx_dma_irqn = DMA1_Channel1_IRQn,
        .tx_dma_request = DMA_REQUEST_USART1_TX,
        .altfunc = GPIO_AF7_USART1,
    },
};

/////////////////////////////////////////

#else
#error "Tell the UART code about your chip's UART."
#include <stophere>
#endif

// Eventually this should be conditional depending on what kind of
// chip you have
#define NUM_UARTS (sizeof(stm32_uart_config) / sizeof(stm32_uart_config[0]))
static stm32_uart_t g_stm32_uarts[NUM_UARTS] = {};

#ifdef USE_RX_DMA_FOR_CHIP
#define USART_USING_RX_DMA(config) ((config)->rx_dma_instance != NULL)
#else
#define USART_USING_RX_DMA(config) (false)
#endif

///// interrupt handlers

#if USE_RX_DMA_FOR_CHIP

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config);

// Called to flush a partial buffer's worth of DMA data up to the upper
// layer. Called when we get an RX Idle interrupt in DMA mode. We disable DMA,
// issue an upcall for any data received, and re-enable DMA again.
static void flush_rx_buf_dma(uint8_t uart_id, stm32_uart_t *u,
                             const stm32_uart_config_t *c) {
  // Disable DMA
  LL_DMA_DisableChannel(c->rx_dma_instance, c->rx_dma_channel);

  // Determine how many bytes are left to read, and thus how many were read
  uint32_t free_space =
      LL_DMA_GetDataLength(c->rx_dma_instance, c->rx_dma_channel);
  uint32_t bytes_read = (u->rx_half_buflen * 2) - free_space;

  // If bytes read is more than half a buffer, it means it's just the second
  // half of the buffer that has new data
  char *base_buf = u->rx_buf;
  if (bytes_read > u->rx_half_buflen) {
    base_buf += u->rx_half_buflen;
    bytes_read -= u->rx_half_buflen;
  }

  // Notify up
  u->tot_rx_bytes += bytes_read;
  u->rx_cb(uart_id, u->user_data, base_buf, bytes_read);

  // Restart DMA reads
  hal_uart_start_rx_dma(u, c);
}

// Send an upcall indicating data ready after a half-complete or full-complete
// interrupt is received from the DMA, indicating an entire half-buffer's worth
// of data (i.e., half our full ping-pong buffer) has been received.
static void dma_complete_upcall(uint8_t uart_id, stm32_uart_t *u, int halfbuf) {
  char *base_buf = u->rx_buf;
  if (halfbuf) {
    base_buf += u->rx_half_buflen;
  }
  u->tot_rx_bytes += u->rx_half_buflen;
  u->rx_cb(uart_id, u->user_data, base_buf, u->rx_half_buflen);
}

// Called when a DMA interrupt arrives for a UART. Determine if it is a
// completion interrupt, and if so, send an upcall.
static void dispatch_rx_dma(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];

  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  if (LL_DMA_IsActiveFlag_HT(config->rx_dma_instance, config->rx_dma_channel)) {
    LL_DMA_ClearFlag_HT(config->rx_dma_instance, config->rx_dma_channel);
    dma_complete_upcall(uart_id, u, 0);
  }

  if (LL_DMA_IsActiveFlag_TC(config->rx_dma_instance, config->rx_dma_channel)) {
    LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
    dma_complete_upcall(uart_id, u, 1);
  }
}

#else

static void flush_rx_buf_dma(uint8_t uart_id, stm32_uart_t *u,
                             const stm32_uart_config_t *c) {
}

#endif

static void dispatch_tx_dma(uint8_t uart_id) {
  const stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }

  HAL_DMA_IRQHandler(u->hal_uart_handle.hdmatx);
}

// For interrupt-mode receiving: Send any rx data that's buffered up to the next
// layer, and switch to the other half-buffer.
static void flush_rx_buf_int(uint8_t uart_id, stm32_uart_t *u) {
  // if there's nothing stored, do nothing
  if (u->rx_bytes_stored == 0) {
    return;
  }

  // send the current buffer up
  u->rx_cb(uart_id, u->user_data, u->rx_curr_base_buf, u->rx_bytes_stored);

