jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
  // switch to the other half
  if (u->rx_curr_base_buf == u->rx_buf) {
    u->rx_curr_base_buf += u->rx_half_buflen;
  } else {
    u->rx_curr_base_buf = u->rx_buf;
  }
  u->rx_bytes_stored = 0;
}

static void receive_char_int(uint8_t uart_id, stm32_uart_t *u, char c) {
  // store the character
  u->rx_curr_base_buf[u->rx_bytes_stored] = c;
  u->rx_bytes_stored++;
  u->tot_rx_bytes++;

  // if the half-buffer has filled, make an upcall
  if (u->rx_bytes_stored == u->rx_half_buflen) {
    flush_rx_buf_int(uart_id, u);
  }
}

static void dispatch_int(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];
  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  // if a character arrived, add it to the rx buffer
  int num_read = 0;
  while (LL_USART_IsActiveFlag_RXNE(c->instance)) {
    // note: we have to read the character whether or not we send it anywhere;
    // reading the char is what clears the interrupt
    num_read++;
    receive_char_int(uart_id, u, LL_USART_ReceiveData8(c->instance));
  }

  // update some statistics
  if (num_read > u->max_chars_per_rx_isr) {
    u->max_chars_per_rx_isr = num_read;
  }
  if (u->min_chars_per_rx_isr == 0 || num_read < u->min_chars_per_rx_isr) {
    u->min_chars_per_rx_isr = num_read;
  }

  // on idle interrupt, flush the rx buffers upwards
  if (LL_USART_IsActiveFlag_IDLE(c->instance)) {
    u->idle_ints++;
    LL_USART_ClearFlag_IDLE(c->instance);
    if (USART_USING_RX_DMA(c)) {
      flush_rx_buf_dma(uart_id, u, c);
    } else {
      flush_rx_buf_int(uart_id, u);
    }
  }

  // handle RX errors by clearing flags and updating statistics
  if (LL_USART_IsActiveFlag_FE(c->instance)) {
    LL_USART_ClearFlag_FE(c->instance);
    u->frame_errors++;
  }
  if (LL_USART_IsActiveFlag_PE(c->instance)) {
    LL_USART_ClearFlag_PE(c->instance);
    u->parity_errors++;
  }
  if (LL_USART_IsActiveFlag_NE(c->instance)) {
    LL_USART_ClearFlag_NE(c->instance);
    u->noise_errors++;
  }
  if (LL_USART_IsActiveFlag_ORE(c->instance)) {
    LL_USART_ClearFlag_ORE(c->instance);
    u->overruns++;
  }

  // dispatch the rest of the interrupt handling through the HAL
  HAL_UART_IRQHandler(&u->hal_uart_handle);
}

/////// transmission

static void maybe_launch_next_tx(stm32_uart_t *uart) {
  assert(uart->next_sendbuf_cb != NULL);
  assert(HAL_UART_GetState(&uart->hal_uart_handle) == HAL_UART_STATE_READY);

  // Ask the layer above for the next buffer to send by calling the "send ready"
  // callback
  const char *buf;
  uint16_t len;
  uart->next_sendbuf_cb(uart->uart_id, uart->user_data, &buf, &len);

  if (len == 0) {
    // tx train complete!
    uart->next_sendbuf_cb = NULL;
  } else {
    uart->tot_tx_bytes += len;
    // Start the transfer
    if (HAL_UART_Transmit_DMA(&uart->hal_uart_handle, (uint8_t *)buf, len) !=
        HAL_OK) {
      __builtin_trap();
    }
  }
}

// Callback called when TX is complete. This overrides a weak symbol in the HAL
// implementation.
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *hal_uart_handle) {
  for (unsigned int i = 0; i < NUM_UARTS; i++) {
    if (&g_stm32_uarts[i].hal_uart_handle == hal_uart_handle) {
      maybe_launch_next_tx(&g_stm32_uarts[i]);
    }
  }
}

static void config_gpio(const stm32_uart_config_t *config, bool rx);

void hal_uart_start_send(uint8_t uart_id, hal_uart_next_sendbuf_cb cb) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->tx_gpio_initted) {
    const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
    config_gpio(config, false);
    u->tx_gpio_initted = true;
  }
  assert(u->next_sendbuf_cb == NULL);
  u->next_sendbuf_cb = cb;
  maybe_launch_next_tx(u);
}

///// reception

#if USE_RX_DMA_FOR_CHIP

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  // Enable DMA RX interrupts
  NVIC_SetPriority(config->rx_dma_irqn, 0);
  NVIC_EnableIRQ(config->rx_dma_irqn);

  LL_DMA_ClearFlag_HT(config->rx_dma_instance, config->rx_dma_channel);
  LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_DMA_ConfigTransfer(config->rx_dma_instance, config->rx_dma_channel,
                        LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
                            LL_DMA_PRIORITY_MEDIUM | LL_DMA_MODE_CIRCULAR |
                            LL_DMA_PERIPH_NOINCREMENT |
                            LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
                            LL_DMA_MDATAALIGN_BYTE);
  LL_DMA_ConfigAddresses(
      config->rx_dma_instance, config->rx_dma_channel,
      LL_USART_DMA_GetRegAddr(config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
      (uint32_t)u->rx_buf,
      LL_DMA_GetDataTransferDirection(config->rx_dma_instance,
                                      config->rx_dma_channel));
  LL_DMA_SetDataLength(config->rx_dma_instance, config->rx_dma_channel,
                       2 * u->rx_half_buflen);
  LL_DMA_SetPeriphRequest(config->rx_dma_instance, config->rx_dma_channel,
                          config->rx_dma_request);
  LL_DMA_EnableIT_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_DMA_EnableIT_HT(config->rx_dma_instance, config->rx_dma_channel);
  LL_USART_EnableDMAReq_RX(config->instance);
  LL_DMA_EnableChannel(config->rx_dma_instance, config->rx_dma_channel);
}

#else

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
}

#endif  // USE_RX_DMA_FOR_CHIP

static void hal_uart_start_rx_interrupt(stm32_uart_t *u,
                                        const stm32_uart_config_t *config) {
  u->rx_bytes_stored = 0;
  LL_USART_EnableIT_RXNE(config->instance);
}

void hal_uart_start_rx(uint8_t uart_id, hal_uart_receive_cb rx_cb, void *buf,
                       size_t buflen) {
  /*
   * Use the Low-Level libraries (not the HAL) to set up the RX interrupt. Yeah,
   * it's a little weird to be using a mix of both HAL and LL. I wanted to use
   * the HAL libraries for the TX DMA, since it's complex. For RX, the HAL
   * libraries don't really do what we want - you have to give them a total
   * length you want to read, and then it shuts everything down again. We want
   * to just start receiving and never stop, with a simple interrupt every time
   * we receive a character.
   */
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  if (!u->rx_gpio_initted) {
    config_gpio(config, true);
    u->rx_gpio_initted = true;
  }

  u->rx_cb = rx_cb;
  u->rx_buf = buf;
  u->rx_curr_base_buf = u->rx_buf;
  u->rx_half_buflen = buflen / 2;

  // If the hardware supports a UART FIFO, enable it
#ifdef LL_USART_ISR_RXNE_RXFNE
  LL_USART_EnableFIFO(config->instance);
#endif

  // Enable the idle interrupt so we can flush rx buffers upwards when each
  // message ends
  LL_USART_ClearFlag_IDLE(config->instance);
  LL_USART_EnableIT_IDLE(config->instance);

